# Homebrew
tap "homebrew/bundle"
tap "homebrew/core"
tap "homebrew/services"
tap "homebrew/cask"
tap "homebrew/cask-drivers"
tap "homebrew/cask-versions"
tap "homebrew/cask-fonts"
tap "heroku/brew"
brew "mas"

# Git
brew "git"
brew "hub"
brew "gh"

# Ruby
brew "ruby"
brew "ruby-install"

# Go
brew "go"

# NodeJS
brew "node"
brew "yarn"
brew "flow"

# iOS
brew "swiftformat"

# Java
cask "java"

# Protobufs
brew "clang-format"
brew "protobuf"
brew "prototool"
brew "grpcurl"

# Docker
cask "docker"

# Google Cloud
cask "google-cloud-sdk"

# Heroku
brew "heroku"

# Tools
brew "autoconf"
brew "automake"
brew "cairo"
brew "carthage"
brew "curl"
brew "ffmpeg"
brew "gawk"
brew "gettext"
brew "graphviz"
brew "jsonpp"
brew "memcached"
brew "pkg-config"
brew "pngcrush"
brew "sqlite"
brew "sox" # For the `play` command
brew "terminal-notifier"
brew "terraform"
brew "translate-shell"
brew "watch"

# Fonts
cask "font-anonymous-pro"
cask "font-fira-code"
cask "font-inconsolata"
cask "font-input"
cask "font-roboto"

# Apps
cask "1password"
cask "arq"
cask "dash"
cask "dropbox"
cask "figma"
cask "google-chrome"
cask "google-chrome-canary"
cask "iterm2-beta"
cask "slack"
cask "sonos"
cask "visual-studio-code"
