# Homebrew
tap "homebrew/bundle"
tap "homebrew/core"
tap "homebrew/services"
tap "homebrew/cask"
tap "homebrew/cask-drivers"
tap "homebrew/cask-versions"

# Core
brew "git"
brew "hub"

# Ruby
brew "ruby"
brew "ruby-install"

# Go
brew "go"

# NodeJS
brew "node"
brew "yarn"
brew "flow"

# iOS
brew "swiftformat"

# Protobufs
brew "clang-format"
brew "protobuf"
brew "prototool"
brew "grpcurl"

# Docker
cask "docker"

# Audio
brew "sox" # For the `play` command

# Graphics
brew "pngcrush"

# Google Cloud
cask "google-cloud-sdk"

# Apps
cask "google-chrome"
cask "google-chrome-canary"

# Tools
brew "autoconf"
brew "automake"
brew "cairo"
brew "carthage"
brew "curl"
brew "ffmpeg"
brew "gawk"
brew "gettext"
brew "graphviz"
brew "heroku"
brew "jsonpp"
brew "memcached"
brew "pkg-config"
brew "sqlite"
brew "terminal-notifier"
brew "terraform"
brew "translate-shell"
brew "watch"
